//1) Напишите условие, которое проверяет, является ли число четным и не равно нулю.

// Задание немного не понял.
// let checkNumber = prompt('Введите число');
//  if (checkNumber % 2 == !0) {
//      alert('Нечетный');
//  } 
//  else if(checkNumber == 0){
//      alert(0);
//  }
// else{
//     alert('четный');
// }


//2) Создайте проверку, которая определяет, принадлежит ли введенное пользователем число к диапазону от 10 до 100.

// let checkNumber = prompt('Введите ваше число');
// if (checkNumber >= 10 && checkNumber <=100 ) {
//     alert('Ваше число в диапозоне')
// } else {
//     alert('Ваше число не в диапозоне')
// }


// 3) Напишите условие, которое проверяет, является ли число четным и больше 10. 
//Выведите сообщение "Число является четным и больше 10" или "Число не 
//является четным и больше 10" в зависимости от результата проверки.


// let checkNumber = prompt('Введите число от 10');
//  if (checkNumber % 2 == 0 && checkNumber >= 10) {
//      alert('Четный и больше 10');
//  } 
//  else if (checkNumber <10){
//     alert('Введите число от 10!!!')
//  }
// else{
//     alert('Не четный и больше 10');
// }


//4) Даны 2 числа. Вернуть если: Eсли оба числа чётные - функция возвращает их произведение. Если оба числа нечётные - 
//функция возвращает их сумму. Если одно из чисел чётное, а второе нечётное - функция возвращает это нечётное число.

//                                                   hz


// 6) Создайте массив с любыми данными, 
//попробуйте изменить третий элемент массива, добавить к конец еще один элемент, и в конце выведите длину массива начиная с 0


// let arr = ["a","b","c","d"];
// arr [3] = 'Agarukuju';
// arr[4] = 'aleka';
// console.log(arr.length); 
// console.log(arr);

// 5)
// alert( null || 2 || undefined ); // 2
// alert( null || 2 && 3 || 4 ); // 3 
// alert( !null || 2 ) //null (true)
// alert( !undefined || 0 ); // undefined (true)
// let x
// alert(x ?? 5); 5 (Так как x пустой)

































